scripts/load-test-results/bench_carbon_intensity.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        uvicorn
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/v1/metrics/carbon_intensity
Document Length:        22 bytes

Concurrency Level:      100
Time taken for tests:   15.635 seconds
Complete requests:      50000
Failed requests:        0
Non-2xx responses:      50000
Total transferred:      7700000 bytes
HTML transferred:       1100000 bytes
Requests per second:    3197.99 [#/sec] (mean)
Time per request:       31.270 [ms] (mean)
Time per request:       0.313 [ms] (mean, across all concurrent requests)
Transfer rate:          480.95 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.9      0      42
Processing:     5   31  17.9     27     347
Waiting:        1   30  17.7     26     347
Total:          6   31  17.8     27     347

Percentage of the requests served within a certain time (ms)
  50%     27
  66%     29
  75%     32
  80%     34
  90%     42
  95%     54
  98%     71
  99%     87
 100%    347 (longest request)