scripts/load-test-results/bench_market_price.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        uvicorn
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/v1/metrics/market_price
Document Length:        22 bytes

Concurrency Level:      100
Time taken for tests:   15.345 seconds
Complete requests:      50000
Failed requests:        0
Non-2xx responses:      50000
Total transferred:      7700000 bytes
HTML transferred:       1100000 bytes
Requests per second:    3258.38 [#/sec] (mean)
Time per request:       30.690 [ms] (mean)
Time per request:       0.307 [ms] (mean, across all concurrent requests)
Transfer rate:          490.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.9      0      36
Processing:     5   30  14.3     26     225
Waiting:        5   30  14.1     25     224
Total:         12   31  14.3     26     225

Percentage of the requests served within a certain time (ms)
  50%     26
  66%     29
  75%     31
  80%     33
  90%     42
  95%     56
  98%     73
  99%     95
 100%    225 (longest request)